import os
import numpy as np


# 根据每个信噪比中的数据找出所有数据的

def getTrueIndexFromSNR():
    # 4000
    # true_index = [[105, 35, 211, 33, 39, 6, 5, 242, 340, 176, 182],
    #               [175, 1772, 67, 1143, 1148, 13, 475, 567, 744, 1000, 1156, 1247, 1602, 1630],
    #               [217, 640, 876]]

    # 8000
    # true_index = [[22, 288, 713, 249, 186, 307, 647, 209, 745, 154, 700, 480],              
    #           #Ha发射线偏的问题
    #           #303能检测出来，2533的可能是，但可能不是
    #             [761, 789, 895, 896, 1185, 1275, 1302, 1453, 2388, 2522, 2619, 2688, 2694, 2697, 2960, 2976, 2978, 3132, 3185, 303, 2555,
    #             3297, 3371, 3377, 3671, 3719, 3863, 2990, 2230, 1883, 1958, 2890, 2983, 497, 1939, 2023, 2416, 331, 2599, 3481, 3531, 
    #             2440, 3539, 2948, 3247, 1845, 2024, 2502, 3488, 2721, 3718, 3673, 1880, 2991, 2926,   
    #             2095, 3449, 3680, 3874, 2082, 3401, 2126, 2867],

    #             [649, 920, 1023, 1360, 1752, 2116, 2365, 2435, 2636, 3140, 3306, 3383, 2665, 1175, 2315]]

    # 12000
    # true_index = [[549, 664, 797, 940, 1060, 1505, 1541, 1698, 138, 1342, 869, 1739,
    #            833, 960, 996, 1754, 991,  330,  443, 1540, 697, 977, 59, 990, 721, 1776, 1020, 1590, 89, 130, 362, 
    #            847, 878, 949, 1234,874,  287,  1555, 598, 989, 449, 932,987,234,  469,  545, 837,985,  
    #            409, 365, 1522,1033,1720, 321,  529,  1787, 338, 910, 954 , 1438, 101, 973],

    #             # 428,679,3020无法检测出来，428倾斜了，919感觉不是 , 4165  4200  4059  2431 都倾斜了
    #            [257, 493, 573, 760, 892, 964, 1348, 1738, 1993, 2137, 2393, 2478, 2501, 3899, 4164, 4211, 4394, 4491, 4557, 
    #             4228,2466, 1455, 4359,  51,   41, 38,   1130, 867, 47,  403, 576, 2546, 691, 805, 1083, 2016, 1936, 
    #             2188,2304, 2447, 3175, 4144, 4171, 4268, 4464, 147,  980, 3276],
  

    #            [692,  931,  1133, 1382, 1603, 1954, 2239, 2334, 2359, 2365, 2381, 2782, 2861, 2896, 3191, 3350, 
    #             3500, 3727, 3889, 3948, 4139, 4168, 4592, 4830, 5500, 5592, 5638, 6047, 6104,
    #             1614, 1805, 3320, 4841,3726, 3289, 3923, 1649, 1903, 2797]]

    # 19000
    # true_index = [[267, 594, 595, 620, 651, 731, 1065, 1734, 1071,748, 1189, 
    #                229, 331, 361, 505, 507, 508, 1431, 66, 800, 623,  1069, 421, 764, 485, 1236,
    #                596, 617, 637, 661, 797, 947, 1133, 1146, 1153, 1504, 1637, 1680, 1857, 1089, 105,
    #                745, 1223,1495,812, 1757, 266, 957, 605,633, 183, 1161, 775, 833, 1622, 493, 
    #                511, 915, 840, 724,1006],

    #             # 无法检测3731，4362，6283，5315,这里的5315感觉不是的,7189和4019可以不是的
    #             [325, 1133, 1256, 1928, 2370, 2496, 3224, 3595, 3930, 3978, 4064, 4422, 4520, 4672, 4796, 4980, 5011, 5522, 
    #             5532, 5904,
    #             195, 2386, 3204, 3309, 3920, 4186, 4189, 4270,5073, 2650, 4777, 4415, 4502,5497, 4791, 5314,
    #             3919, 4417, 4058, 4733, 4063, 4434, 552, 1687, 2236, 5275, 5106, 5250, 5408, 5605, 4440,
    #             6283,4371,5097],

    #             [376, 419, 574, 926, 2645, 2702, 2859, 3018, 3285, 3355, 4827, 4839, 5081, 5637, 6222, 6697, 7387, 8980, 
    #             9623, 10030, 10048, 
    #             2522, 3918, 4223, 6455, 5814]]

    
    # 以前的
    true_index = [[55, 194, 213, 400, 452, 481, 488],
                  [135, 161, 218, 672, 690, 1068, 1161, 1226, 1396, 1529, 1697],
                  [64, 322, 897, 918, 1061, 1439, 1528, 1639, 2221]]

    return true_index


def getAllName(true_index, file_name):
    list_dir_snr = os.listdir(file_name)
    all_file_name = []
    # all_file_name = [[] for _ in range(len(list_dir_snr))] 
    for index,one_dir in enumerate(list_dir_snr):
        print(one_dir)
        list_file = os.listdir(file_name + '/' + one_dir)
        one_true_index = true_index[index]
        one_file = [list_file[true_index_index-1] for true_index_index in one_true_index]
        # all_file_name[index].append(list_file[true_index[index]])
        all_file_name.append(one_file)
    return all_file_name

def getAll(all_file_name, all_data_file):
    all_data = []
    all_file = []
    with open(all_data_file,'r') as f:
        for one_file in f.readlines():
            # print('one_file:', one_file)
            all_data.append(one_file.strip())
    print('all_data:', all_data)
    print('元素的总个数:', len(all_data))
    for one_snr_file_name in all_file_name:
        for one_file_name in one_snr_file_name:
            print(one_file_name)
            all_file.append(all_data.index(one_file_name))

    return all_file


if __name__ == '__main__':
    file_name = 'fitDatas'
    all_data_file = '19000allData.txt'
    # 得出每个信噪比中的索引
    true_index = getTrueIndexFromSNR()
    # 根据每个索引序号得到名称
    all_file_name = getAllName(true_index, file_name)
    for one_file_name in all_file_name:
        for name in one_file_name:
            with open('fitData.txt','a') as f:
                f.write(str(name) + '\n')
    print(all_file_name)
    aa = aa
    # 得到在所有的数据中的索引
    all_file = getAll(all_file_name, all_data_file)
    print(all_file)
    print('正类的元素的个数', len(all_file))
    # 将结果保存下来
    with open('19411-true-index.txt','w') as f:
        f.write(str(all_file))
    print('程序结束')
    

